Revit 2024 API
PanelTypeSet.Erase Method
Removes a specified panel type from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	PanelType item
)
Visual Basic
Public Overridable Function Erase ( _
	item As PanelType _
) As Integer
Visual C++
public:
virtual int Erase(
	PanelType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.PanelType
The panel type to be erased.
Return Value
The number of panel types that were erased from the set.
See Also
PanelTypeSet Class
Autodesk.Revit.DB Namespace